---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyDataSettings.CreateAnalyticalModel
source: html/bdb566d6-054a-41f4-2508-081e097f34bf.htm
---
# Autodesk.Revit.DB.Analysis.EnergyDataSettings.CreateAnalyticalModel Property

If this is true, data, features, and geometry related to the Energy Analytical Model
 will be created, allowing the energy performance to be analyzed through GreenBuilidingXML.

## Syntax (C#)
```csharp
public bool CreateAnalyticalModel { get; }
```